{
  "version": "1.0",
  "sections": [
    {
      "id": 1,
      "stepNumber": 1,
      "titleBangla": "ইহরাম",
      "titleArabic": "الإحرام",
      "description": "ইহরাম হলো ওমরাহর প্রথম ও অন্যতম গুরুত্বপূর্ণ রুকন। মীকাত থেকে ইহরাম বাঁধতে হয়। ইহরাম হলো একটি বিশেষ নিয়ত যার মাধ্যমে ওমরাহ শুরু হয় এবং কিছু নির্দিষ্ট কাজ নিষিদ্ধ হয়ে যায়।",
      "rules": [
        "গোসল করা সুন্নত (মহিলাদের হায়েয-নিফাস অবস্থায়ও)",
        "পুরুষদের জন্য সাদা সেলাইবিহীন দুই টুকরা কাপড় (ইজার ও রিদা) পরিধান করা",
        "মহিলারা স্বাভাবিক শালীন পোশাক পরবেন (মুখ ও হাত খোলা রাখবেন)",
        "ইহরামের পূর্বে সুগন্ধি ব্যবহার করা সুন্নত",
        "দুই রাকাত নফল নামাজ পড়া মুস্তাহাব",
        "মীকাত অতিক্রমের পূর্বে ইহরামের নিয়ত ও তালবিয়া পাঠ করা ফরজ"
      ],
      "relatedDuas": [
        {
          "id": 1,
          "titleBangla": "ইহরামের নিয়ত",
          "arabicText": "لَبَّيْكَ اللَّهُمَّ عُمْرَةً",
          "banglaTransliteration": "লাব্বাইকা আল্লাহুম্মা উমরাতান।",
          "banglaMeaning": "হে আল্লাহ! আমি ওমরাহর জন্য হাজির হয়েছি।",
          "occasion": "ইহরাম বাঁধার সময় (মীকাতে)"
        },
        {
          "id": 2,
          "titleBangla": "তালবিয়া",
          "arabicText": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ",
          "banglaTransliteration": "লাব্বাইকা আল্লাহুম্মা লাব্বাইক, লাব্বাইকা লা শারীকা লাকা লাব্বাইক, ইন্নাল হামদা ওয়ান নি'মাতা লাকা ওয়াল মুলক, লা শারীকা লাক।",
          "banglaMeaning": "আমি হাজির হে আল্লাহ, আমি হাজির। আমি হাজির, তোমার কোনো শরিক নেই, আমি হাজির। নিশ্চয়ই সকল প্রশংসা, নিয়ামত ও রাজত্ব তোমারই, তোমার কোনো শরিক নেই।",
          "occasion": "ইহরাম থেকে তাওয়াফ শুরু পর্যন্ত বারবার উচ্চস্বরে পাঠ করতে হয় (মহিলারা আস্তে পড়বেন)"
        }
      ]
    },
    {
      "id": 2,
      "stepNumber": 2,
      "titleBangla": "তাওয়াফ",
      "titleArabic": "الطواف",
      "description": "তাওয়াফ হলো কাবা শরীফকে ৭ বার প্রদক্ষিণ করা। এটি ওমরাহর দ্বিতীয় রুকন এবং অত্যন্ত গুরুত্বপূর্ণ ইবাদত। তাওয়াফের সময় বিনয়ের সাথে আল্লাহর কাছে দোয়া করতে হয়।",
      "rules": [
        "হাজরে আসওয়াদ (কালো পাথর) থেকে তাওয়াফ শুরু করতে হয়",
        "কাবা শরীফকে বাম দিকে রেখে ঘড়ির কাঁটার বিপরীত দিকে ঘুরতে হয়",
        "মোট ৭ চক্কর সম্পন্ন করতে হয় (১ চক্কর = হাজরে আসওয়াদ থেকে শুরু করে আবার হাজরে আসওয়াদে ফিরে আসা)",
        "প্রতি চক্কর শুরুতে হাজরে আসওয়াদ চুম্বন/স্পর্শ/ইশারা করা সুন্নত",
        "রুকনে ইয়ামানী স্পর্শ করা সুন্নত (চুম্বন নয়)",
        "পুরুষদের জন্য প্রথম ৩ চক্করে 'রমল' (দ্রুত হাঁটা) করা সুন্নত",
        "পুরুষদের ডান কাঁধ খোলা রাখা (ইজতিবা) সুন্নত",
        "তাওয়াফ শেষে মাকামে ইবরাহীমের পেছনে ২ রাকাত নামাজ পড়া ওয়াজিব"
      ],
      "relatedDuas": [
        {
          "id": 3,
          "titleBangla": "তাওয়াফ শুরুর দোয়া (হাজরে আসওয়াদে)",
          "arabicText": "بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ، اللَّهُمَّ إِيمَانًا بِكَ وَتَصْدِيقًا بِكِتَابِكَ وَوَفَاءً بِعَهْدِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
          "banglaTransliteration": "বিসমিল্লাহি ওয়াল্লাহু আকবার, আল্লাহুম্মা ঈমানান বিকা ওয়া তাসদীক্বান বি কিতাবিকা ওয়া ওয়াফাআন বি 'আহদিকা ওয়াত্তিবা'আন লি সুন্নাতি নাবিয়্যিকা মুহাম্মাদিন সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম।",
          "banglaMeaning": "আল্লাহর নামে এবং আল্লাহ মহান। হে আল্লাহ! তোমার প্রতি ঈমান রেখে, তোমার কিতাবকে সত্য মেনে, তোমার অঙ্গীকার পূরণ করে এবং তোমার নবী মুহাম্মাদ (সা.) এর সুন্নাহ অনুসরণ করে (এই তাওয়াফ করছি)।",
          "occasion": "প্রতি চক্করে হাজরে আসওয়াদের কাছে"
        },
        {
          "id": 4,
          "titleBangla": "রুকনে ইয়ামানী ও হাজরে আসওয়াদের মধ্যবর্তী দোয়া",
          "arabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
          "banglaTransliteration": "রাব্বানা আতিনা ফিদ্দুনইয়া হাসানাতাও ওয়া ফিল আখিরাতি হাসানাতাও ওয়া ক্বিনা 'আযাবান্নার।",
          "banglaMeaning": "হে আমাদের রব! আমাদেরকে দুনিয়াতে কল্যাণ দান করুন এবং আখিরাতেও কল্যাণ দান করুন এবং আমাদেরকে জাহান্নামের আজাব থেকে রক্ষা করুন।",
          "occasion": "রুকনে ইয়ামানী স্পর্শ করার পর থেকে হাজরে আসওয়াদ পর্যন্ত"
        },
        {
          "id": 5,
          "titleBangla": "তাওয়াফের সাধারণ দোয়া",
          "arabicText": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "banglaTransliteration": "সুবহানাল্লাহি ওয়াল হামদু লিল্লাহি ওয়া লা ইলাহা ইল্লাল্লাহু ওয়াল্লাহু আকবার ওয়া লা হাওলা ওয়ালা কুওয়্যাতা ইল্লা বিল্লাহ।",
          "banglaMeaning": "আল্লাহ পবিত্র, সকল প্রশংসা আল্লাহর, আল্লাহ ছাড়া কোনো উপাস্য নেই, আল্লাহ মহান এবং আল্লাহ ছাড়া কোনো শক্তি ও সামর্থ্য নেই।",
          "occasion": "তাওয়াফের যেকোনো সময়"
        }
      ]
    },
    {
      "id": 3,
      "stepNumber": 3,
      "titleBangla": "সাঈ",
      "titleArabic": "السعي",
      "description": "সাফা ও মারওয়া পাহাড়ের মধ্যে ৭ বার দৌড়ানো/হাঁটা। এটি হযরত হাজেরা (আ.) এর পানির সন্ধানে দৌড়ানোর স্মৃতি। সাঈ ওমরাহর তৃতীয় রুকন।",
      "rules": [
        "সাফা পাহাড় থেকে সাঈ শুরু করতে হয়",
        "সাফা থেকে মারওয়া = ১ম ফেরত, মারওয়া থেকে সাফা = ২য় ফেরত (এভাবে মোট ৭ ফেরত)",
        "শেষ ফেরত মারওয়ায় শেষ হবে",
        "পুরুষদের জন্য দুই সবুজ বাতির মধ্যবর্তী স্থানে দ্রুত হাঁটা/দৌড়ানো সুন্নত",
        "মহিলারা স্বাভাবিক গতিতে হাঁটবেন",
        "সাফা ও মারওয়ায় কিবলামুখী হয়ে দোয়া করা সুন্নত",
        "সাঈর জন্য ওজু শর্ত নয় তবে উত্তম"
      ],
      "relatedDuas": [
        {
          "id": 6,
          "titleBangla": "সাফায় উঠে দোয়া",
          "arabicText": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ",
          "banglaTransliteration": "ইন্নাস সাফা ওয়াল মারওয়াতা মিন শা'আইরিল্লাহ। ফা মান হাজ্জাল বাইতা আউই'তামারা ফালা জুনাহা 'আলাইহি আই ইয়াত্তাওয়াফা বিহিমা। ওয়া মান তাতাওয়া'আ খাইরান ফা ইন্নাল্লাহা শাকিরুন 'আলীম।",
          "banglaMeaning": "নিশ্চয়ই সাফা ও মারওয়া আল্লাহর নিদর্শনসমূহের অন্তর্ভুক্ত। যে ব্যক্তি হজ বা ওমরাহ করবে তার জন্য এই দুটির মাঝে সাঈ করায় কোনো দোষ নেই। যে স্বেচ্ছায় সৎকর্ম করে, নিশ্চয়ই আল্লাহ কৃতজ্ঞতা স্বীকারকারী, সর্বজ্ঞ। (সূরা বাকারা: ১৫৮)",
          "occasion": "প্রথমবার সাফায় উঠে (এরপর আর পড়তে হবে না)"
        },
        {
          "id": 7,
          "titleBangla": "সাফা ও মারওয়ায় তাকবীর ও দোয়া",
          "arabicText": "اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ",
          "banglaTransliteration": "আল্লাহু আকবার, আল্লাহু আকবার, আল্লাহু আকবার। লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহ, লাহুল মুলকু ওয়া লাহুল হামদু ওয়া হুয়া 'আলা কুল্লি শাইয়িন ক্বাদীর। লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু, আনজাযা ওয়া'দাহু ওয়া নাসারা 'আবদাহু ওয়া হাযামাল আহযাবা ওয়াহদাহ।",
          "banglaMeaning": "আল্লাহ মহান, আল্লাহ মহান, আল্লাহ মহান। আল্লাহ ছাড়া কোনো উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই। রাজত্ব তাঁরই, প্রশংসা তাঁরই এবং তিনি সকল কিছুর উপর ক্ষমতাবান। আল্লাহ ছাড়া কোনো উপাস্য নেই, তিনি একক। তিনি তাঁর ওয়াদা পূর্ণ করেছেন, তাঁর বান্দাকে সাহায্য করেছেন এবং একাই শত্রু দলকে পরাজিত করেছেন।",
          "occasion": "সাফা ও মারওয়ায় কাবামুখী হয়ে (৩ বার পড়া সুন্নত)"
        },
        {
          "id": 8,
          "titleBangla": "সাঈর মধ্যে সাধারণ দোয়া",
          "arabicText": "رَبِّ اغْفِرْ وَارْحَمْ إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ",
          "banglaTransliteration": "রাব্বিগফির ওয়ারহাম ইন্নাকা আনতাল আ'আযযুল আকরাম।",
          "banglaMeaning": "হে আমার রব! ক্ষমা করুন এবং দয়া করুন, নিশ্চয়ই আপনি সবচেয়ে সম্মানিত ও মহানুভব।",
          "occasion": "সাফা ও মারওয়ার মধ্যে চলার সময়"
        }
      ]
    },
    {
      "id": 4,
      "stepNumber": 4,
      "titleBangla": "হালক বা তাকসীর",
      "titleArabic": "الحلق أو التقصير",
      "description": "মাথার চুল মুণ্ডন (হালক) বা ছোট করা (তাকসীর)। এটি ওমরাহর চতুর্থ ও শেষ রুকন। এর মাধ্যমে ওমরাহ সম্পন্ন হয় এবং ইহরামের নিষেধাজ্ঞা থেকে মুক্ত হওয়া যায়।",
      "rules": [
        "পুরুষদের জন্য মাথা মুণ্ডন করা (হালক) অথবা সমস্ত চুল ছোট করা (তাকসীর)",
        "মাথা মুণ্ডন করা উত্তম ও বেশি সওয়াবের কাজ",
        "মহিলারা চুলের প্রান্ত থেকে আঙ্গুলের এক কর পরিমাণ (প্রায় ১ ইঞ্চি) কাটবেন",
        "মহিলাদের জন্য মাথা মুণ্ডন করা হারাম",
        "এটি সম্পন্ন হলে ইহরামের সকল নিষেধাজ্ঞা শেষ হয়ে যায়",
        "স্বাভাবিক পোশাক পরিধান করা যায়"
      ],
      "relatedDuas": [
        {
          "id": 9,
          "titleBangla": "হালক/তাকসীরের পর দোয়া",
          "arabicText": "الْحَمْدُ لِلَّهِ الَّذِي قَضَى عَنَّا نُسُكَنَا",
          "banglaTransliteration": "আলহামদু লিল্লাহিল্লাযী ক্বাদ্বা 'আন্না নুসুকানা।",
          "banglaMeaning": "সকল প্রশংসা আল্লাহর জন্য যিনি আমাদের ইবাদত সম্পন্ন করার তাওফীক দিয়েছেন।",
          "occasion": "হালক বা তাকসীর সম্পন্ন করার পর"
        },
        {
          "id": 10,
          "titleBangla": "ওমরাহ সমাপ্তির শুকরিয়া",
          "arabicText": "اللَّهُمَّ تَقَبَّلْ مِنِّي وَأَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
          "banglaTransliteration": "আল্লাহুম্মা তাক্বাব্বাল মিন্নী ওয়া আ'ইন্নী 'আলা যিকরিকা ওয়া শুকরিকা ওয়া হুসনি 'ইবাদাতিক।",
          "banglaMeaning": "হে আল্লাহ! আমার থেকে কবুল করুন এবং আপনার যিকির, কৃতজ্ঞতা ও উত্তম ইবাদতের ক্ষেত্রে আমাকে সাহায্য করুন।",
          "occasion": "ওমরাহ সম্পন্ন হওয়ার পর"
        }
      ]
    }
  ]
}
